Config/DataProcessors/ИзменениеОкладовМассово.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<DataProcessor>
		<Properties>
			<Name>ИзменениеОкладовМассово</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Оклад</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/InformationRegisters/КадровыеПеремещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<InformationRegister>
		<Properties>
			<Name>КадровыеПеремещения</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Подразделение</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Должность</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оклад</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КадровыеДействия</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Enums/КадровыеДействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Enum>
		<Properties>
			<Name>КадровыеДействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Найм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Увольнение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Config/DataProcessors/ИзменениеОкладовМассово/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура СотрудникиСотрудникПриИзменении(Элемент)
	
	   Попытка
		
		ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
		
		// Проверяем, что не уволен
		Если СотрудникУволенНаСервере(ТекущаяСтрока.Сотрудник) Тогда
			
			Сообщить("Сотрудник """ + ТекущаяСтрока.Сотрудник + """ уже уволен!");
			ТекущаяСтрока.Сотрудник = Неопределено;
			Возврат;
			
		КонецЕсли;
		
		// Получаем данные сотрудника для заполнения полей
		ИнфоСотрудника = ПолучитьДанныеСотрудникаССервера(ТекущаяСтрока.Сотрудник);
		
		// Заполняем поля текущими данными сотрудника
		ТекущаяСтрока.Оклад = ИнфоСотрудника.Оклад;
		
	Исключение
		
		Сообщить("Ошибка: " + ОписаниеОшибки());
		
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция СотрудникУволенНаСервере(СотрудникСсылка)
	Возврат СотрудникУволен(СотрудникСсылка);	
КонецФункции
   
&НаСервере
Функция ПолучитьДанныеСотрудникаССервера(СотрудникСсылка)
   Возврат ПолучитьДанныеСотрудникаПоСсылке(СотрудникСсылка);	
КонецФункции


&НаКлиенте
Процедура КомандаВыполнить(Команда)
	
	Для Каждого Строка Из Объект.Сотрудники Цикл
		УстановитьОкладСотрудникуНаСервере(Строка.Сотрудник, Строка.Оклад);
	КонецЦикла;
	
	Если Объект.Сотрудники.Количество() = 0 Тогда
		Сообщить("Сначала добавьте сотрудников!");
	Иначе
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура УстановитьОкладСотрудникуНаСервере(СотрудникСсылка, НовыйОклад)
	
	Если ЗначениеЗаполнено(СотрудникСсылка) И ТипЗнч(НовыйОклад) = Тип("Число") Тогда
		ОбъектСотрудник = СотрудникСсылка.ПолучитьОбъект();
		// изменяем данные объекта
		ОбъектСотрудник.Оклад = НовыйОклад;
		ОбъектСотрудник.Записать();
	Иначе
		Сообщить("Переданы неправильные значения");	
	КонецЕсли;
	                       
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	// устанавливаем выбранное значение
	Объект.Подразделение = ВыбранноеЗначение;
	
	ПодразделениеОбработкаВыбораНаСервере();
	// обновляем таблицу
	Элементы.Сотрудники.Обновить();
	
КонецПроцедуры

&НаСервере
Процедура ПодразделениеОбработкаВыбораНаСервере()
	
	// получаем сотрудников подразделения из запроса	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КадровыеПеремещенияСрезПоследних.Сотрудник
		|ИЗ
		|	РегистрСведений.КадровыеПеремещения.СрезПоследних КАК КадровыеПеремещенияСрезПоследних
		|ГДЕ
		|	КадровыеПеремещенияСрезПоследних.Подразделение = &Подразделение
		|	И КадровыеПеремещенияСрезПоследних.Действие <> &ДействиеУвольнение";
	
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);  
	Запрос.УстановитьПараметр("ДействиеУвольнение", Перечисления.КадровыеДействия.Увольнение); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	// чистим таблицу
	Объект.Сотрудники.Очистить();
	// заполняем таблицу
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрока = Объект.Сотрудники.Добавить();
		НоваяСтрока.Сотрудник =  ВыборкаДетальныеЗаписи.Сотрудник;
		НоваяСтрока.Оклад =  ВыборкаДетальныеЗаписи.Сотрудник.Оклад;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	
	Объект.Сотрудники.Очистить();
	Объект.Подразделение = Неопределено;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиОкладПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Сотрудники.ТекущиеДанные;
	МРОТ = ПолучитьМРОТССервера();
	
	Если ТекущаяСтрока.Оклад < МРОТ Тогда
		Сообщить("Оклад не может быть ниже МРОТ!");
		ТекущаяСтрока.Оклад = МРОТ;
	КонецЕсли;

КонецПроцедуры


&НаСервере
  Функция ПолучитьМРОТССервера()
	  Возврат Константы.МРОТ.Получить();
  КонецФункции
